# AnalyticalModelArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelArea Property
ParameterTypeId Class See Also
---
"Area": The Area of Analytical Model
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace